{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "String": "\t"
    },
    "behavior": "Removed",
    "invert": false
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      "HR-T2PKS": 5,
      "1-cysPrx_C": 6,
      "120_Rick_ant": 7,
      "12TM_1": 8,
      "14-3-3": 9,
      "17kDa_Anti_2": 10,
      "2-Hacid_dh": 11,
      "2-Hacid_dh_C": 12,
      "2-oxoacid_dh": 13,
      "2-oxogl_dehyd_N": 14,
      "2-ph_phosp": 15,
      "2-thiour_desulf": 16,
      "23ISL": 17,
      "23S_rRNA_IVP": 18,
      "2CSK_N": 19,
      "2C_adapt": 20,
      "2EXR": 21,
      "2Fe-2S_Ferredox": 22,
      "2Fe-2S_thioredx": 23,
      "2H-phosphodiest": 24,
      "2HCT": 25,
      "2OG-FeII_Oxy": 26,
      "2OG-FeII_Oxy_2": 27,
      "2OG-FeII_Oxy_3": 28,
      "2OG-FeII_Oxy_4": 29,
      "2OG-FeII_Oxy_5": 30,
      "2OG-FeII_Oxy_6": 31,
      "2OG-Fe_Oxy_2": 32,
      "2TM": 33,
      "2_5_RNA_ligase2": 34,
      "3-HAO": 35,
      "3-PAP": 36,
      "3-alpha": 37,
      "3-dmu-9_3-mt": 38,
      "30K_MP_C_Ter": 39,
      "30K_MP_core": 40,
      "3A": 41,
      "3Beta_HSD": 42,
      "3D": 43,
      "3H": 44,
      "3HBOH": 45,
      "3HCDH": 46,
      "3HCDH_N": 47,
      "3HCDH_RFF": 48,
      "3keto-disac_hyd": 49,
      "40S_S4_C": 50,
      "40S_SA_C": 51,
      "4F5": 52,
      "4HB": 53,
      "4HBT": 54,
      "4HBT_2": 55,
      "4HBT_3": 56,
      "4HB_MCP_1": 57,
      "4HFCP_synth": 58,
      "4HPAD_g_N": 59,
      "4PPT_N": 60,
      "4_1_CTD": 61,
      "5-FTHF_cyc-lig": 62,
      "5-nucleotidase": 63,
      "53-BP1_Tudor": 64,
      "5HT_transport_N": 65,
      "5TM-5TMR_LYT": 66,
      "5_3_exonuc": 67,
      "5_3_exonuc_N": 68,
      "5_nucleotid": 69,
      "5_nucleotid_C": 70,
      "60KD_IMP": 71,
      "6PF2K": 72,
      "6PGD": 73,
      "7TM-7TMR_HD": 74,
      "7TMR-DISMED2": 75,
      "7TMR-DISM_7TM": 76,
      "7TMR-HDED": 77,
      "7TM_GPCR_Sra": 78,
      "7TM_GPCR_Srab": 79,
      "7TM_GPCR_Srb": 80,
      "7TM_GPCR_Srbc": 81,
      "7TM_GPCR_Srd": 82,
      "7TM_GPCR_Srh": 83,
      "7TM_GPCR_Sri": 84,
      "7TM_GPCR_Srj": 85,
      "7TM_GPCR_Srsx": 86,
      "7TM_GPCR_Srt": 87,
      "7TM_GPCR_Sru": 88,
      "7TM_GPCR_Srv": 89,
      "7TM_GPCR_Srw": 90,
      "7TM_GPCR_Srx": 91,
      "7TM_GPCR_Srz": 92,
      "7TM_GPCR_Str": 93,
      "7TM_transglut": 94,
      "7kD_DNA_binding": 95,
      "7tm_1": 96,
      "7tm_2": 97,
      "7tm_3": 98,
      "7tm_4": 99,
      "7tm_6": 100,
      "7tm_7": 101,
      "8TM_micro": 102,
      "A-2_8-polyST": 103,
      "A1_Propeptide": 104,
      "A2L_zn_ribbon": 105,
      "A2M": 106,
      "A2M_BRD": 107,
      "A2M_recep": 108,
      "AA9": 109,
      "AAA": 110,
      "AAA-ATPase_like": 111,
      "AAA_10": 112,
      "AAA_11": 113,
      "AAA_12": 114,
      "AAA_13": 115,
      "AAA_14": 116,
      "AAA_15": 117,
      "AAA_16": 118,
      "AAA_17": 119,
      "AAA_18": 120,
      "AAA_19": 121,
      "AAA_2": 122,
      "AAA_21": 123,
      "AAA_22": 124,
      "AAA_23": 125,
      "AAA_24": 126,
      "AAA_25": 127,
      "AAA_26": 128,
      "AAA_27": 129,
      "AAA_28": 130,
      "AAA_29": 131,
      "AAA_3": 132,
      "AAA_30": 133,
      "AAA_31": 134,
      "AAA_32": 135,
      "AAA_33": 136,
      "AAA_34": 137,
      "AAA_35": 138,
      "AAA_5": 139,
      "AAA_6": 140,
      "AAA_7": 141,
      "AAA_8": 142,
      "AAA_9": 143,
      "AAA_PrkA": 144,
      "AAA_assoc": 145,
      "AAA_assoc_2": 146,
      "AAA_assoc_C": 147,
      "AAA_lid_1": 148,
      "AAA_lid_10": 149,
      "AAA_lid_11": 150,
      "AAA_lid_2": 151,
      "AAA_lid_3": 152,
      "AAA_lid_4": 153,
      "AAA_lid_5": 154,
      "AAA_lid_6": 155,
      "AAA_lid_7": 156,
      "AAA_lid_8": 157,
      "AAA_lid_9": 158,
      "AAL_decarboxy": 159,
      "AAR2": 160,
      "AARP2CN": 161,
      "AAT": 162,
      "AATF-Che1": 163,
      "AATase": 164,
      "AA_kinase": 165,
      "AA_permease": 166,
      "AA_permease_2": 167,
      "AA_permease_C": 168,
      "AA_permease_N": 169,
      "AA_synth": 170,
      "ABA4-like": 171,
      "ABATE": 172,
      "ABA_GPCR": 173,
      "ABA_WDS": 174,
      "ABC-3": 175,
      "ABC1": 176,
      "ABC2_membrane": 177,
      "ABC2_membrane_2": 178,
      "ABC2_membrane_3": 179,
      "ABC2_membrane_4": 180,
      "ABC2_membrane_5": 181,
      "ABC2_membrane_6": 182,
      "ABC2_membrane_7": 183,
      "ABC_ATPase": 184,
      "ABC_N": 185,
      "ABC_cobalt": 186,
      "ABC_export": 187,
      "ABC_membrane": 188,
      "ABC_membrane_2": 189,
      "ABC_membrane_3": 190,
      "ABC_sub_bind": 191,
      "ABC_toxin_N": 192,
      "ABC_tran": 193,
      "ABC_tran_2": 194,
      "ABC_tran_CTD": 195,
      "ABC_tran_Xtn": 196,
      "ABC_trans_CmpB": 197,
      "ABC_trans_N": 198,
      "ABC_trans_aux": 199,
      "ABC_transp_aux": 200,
      "ABG_transport": 201,
      "ABHD18": 202,
      "ABM": 203,
      "ACAS_N": 204,
      "ACBP": 205,
      "ACCA": 206,
      "ACC_central": 207,
      "ACC_epsilon": 208,
      "ACD": 209,
      "ACDC": 210,
      "ACDH_C": 211,
      "ACI44": 212,
      "ACOX": 213,
      "ACP": 214,
      "ACP53EA": 215,
      "ACPS": 216,
      "ACP_PD": 217,
      "ACP_syn_III": 218,
      "ACP_syn_III_C": 219,
      "ACR_tran": 220,
      "ACS_CODH_B_C": 221,
      "ACT": 222,
      "ACTH_assoc": 223,
      "ACTH_domain": 224,
      "ACTL7A_N": 225,
      "ACT_3": 226,
      "ACT_4": 227,
      "ACT_5": 228,
      "ACT_6": 229,
      "ACT_7": 230,
      "ACT_8": 231,
      "AC_1": 232,
      "AC_N": 233,
      "AChE_tetra": 234,
      "AD": 235,
      "ADAM17_MPD": 236,
      "ADAMTS_CR_2": 237,
      "ADAMTS_CR_3": 238,
      "ADAMTS_spacer1": 239,
      "ADAM_CR": 240,
      "ADC": 241,
      "ADD_ATRX": 242,
      "ADD_DNMT3": 243,
      "ADH_N": 244,
      "ADH_N_2": 245,
      "ADH_N_assoc": 246,
      "ADH_zinc_N": 247,
      "ADH_zinc_N_2": 248,
      "ADI": 249,
      "ADIP": 250,
      "ADK": 251,
      "ADK_lid": 252,
      "ADNP_N": 253,
      "ADPRTs_Tse2": 254,
      "ADP_PFK_GK": 255,
      "ADP_ribosyl_GH": 256,
      "ADPrib_exo_Tox": 257,
      "ADSL_C": 258,
      "ADYC": 259,
      "AEP1": 260,
      "AF-4": 261,
      "AF-4_C": 262,
      "AF0941-like": 263,
      "AF2212-like": 264,
      "AF2331-like": 265,
      "AF4_int": 266,
      "AFG1_ATPase": 267,
      "AFOR_C": 268,
      "AFOR_N": 269,
      "AFP": 270,
      "AFP_2": 271,
      "AFT": 272,
      "AGA2": 273,
      "AGH": 274,
      "AGK_C": 275,
      "AGL_N": 276,
      "AGOG": 277,
      "AGO_N": 278,
      "AGP": 279,
      "AGRB_N": 280,
      "AGS_C": 281,
      "AGT": 282,
      "AGTRAP": 283,
      "AHD": 284,
      "AHH": 285,
      "AHJR-like": 286,
      "AHL_synthase": 287,
      "AHSA1": 288,
      "AHSP": 289,
      "AI-2E_transport": 290,
      "AIB": 291,
      "AICARFT_IMPCHas": 292,
      "AID": 293,
      "AIDA": 294,
      "AIF-MLS": 295,
      "AIF_C": 296,
      "AIG1": 297,
      "AIG2_2": 298,
      "AIM24": 299,
      "AIM3": 300,
      "AIM5": 301,
      "AIMP2_LysRS_bd": 302,
      "AIP3": 303,
      "AIPR": 304,
      "AIRC": 305,
      "AIRS": 306,
      "AIRS_C": 307,
      "AJAP1_PANP_C": 308,
      "AKAP28": 309,
      "AKAP2_C": 310,
      "AKAP7_NLS": 311,
      "AKAP7_RIRII_bdg": 312,
      "AKAP95": 313,
      "AKAP_110": 314,
      "AKNA": 315,
      "ALAD": 316,
      "ALC": 317,
      "ALF": 318,
      "ALG11_N": 319,
      "ALG3": 320,
      "ALGX": 321,
      "ALIX_LYPXL_bnd": 322,
      "ALKBH8_N": 323,
      "ALMS_motif": 324,
      "ALMS_repeat": 325,
      "ALMT": 326,
      "ALO": 327,
      "ALOG_dom": 328,
      "ALP_N": 329,
      "ALS2CR11": 330,
      "ALS2CR8": 331,
      "ALS_ss_C": 332,
      "ALTTAQ_rpt": 333,
      "AMA-1": 334,
      "AMH_N": 335,
      "AMIN": 336,
      "AMMECR1": 337,
      "AMNp_N": 338,
      "AMO": 339,
      "AMOP": 340,
      "AMP-binding": 341,
      "AMP-binding_C": 342,
      "AMP-binding_C_2": 343,
      "AMPK1_CBM": 344,
      "AMPKBI": 345,
      "AMP_N": 346,
      "AMP_deaminase": 347,
      "AMT4_dom_C": 348,
      "ANAPC1": 349,
      "ANAPC10": 350,
      "ANAPC15": 351,
      "ANAPC16": 352,
      "ANAPC2": 353,
      "ANAPC3": 354,
      "ANAPC4": 355,
      "ANAPC4_WD40": 356,
      "ANAPC5": 357,
      "ANAPC8": 358,
      "ANAPC9": 359,
      "ANAPC_CDC26": 360,
      "ANATO": 361,
      "ANF_receptor": 362,
      "ANGEL2_N": 363,
      "ANIS5_cation-bd": 364,
      "ANKH": 365,
      "ANP": 366,
      "ANT": 367,
      "ANTAR": 368,
      "ANTH": 369,
      "ANXA2R": 370,
      "AOC_like": 371,
      "AOX": 372,
      "AP-5_subunit_s1": 373,
      "AP1AR": 374,
      "AP2": 375,
      "AP3B1_C": 376,
      "AP3D1": 377,
      "AP4E_app_platf": 378,
      "APAF1_C": 379,
      "APC1_C": 380,
      "APCDDC": 381,
      "APC_15aa": 382,
      "APC_N_CC": 383,
      "APC_basic": 384,
      "APC_r": 385,
      "APC_rep": 386,
      "APC_u13": 387,
      "APC_u14": 388,
      "APC_u15": 389,
      "APC_u5": 390,
      "APC_u9": 391,
      "APEH_N": 392,
      "APG12": 393,
      "APG5": 394,
      "APG6": 395,
      "APG6_N": 396,
      "APH": 397,
      "APH_6_hur": 398,
      "API5": 399,
      "APOBEC1": 400,
      "APOBEC2": 401,
      "APOBEC3": 402,
      "APOBEC4": 403,
      "APOBEC4_like": 404,
      "APOBEC_C": 405,
      "APOBEC_N": 406,
      "APOC4": 407,
      "APO_RNA-bind": 408,
      "APP1_cat": 409,
      "APP_Cu_bd": 410,
      "APP_E2": 411,
      "APP_N": 412,
      "APP_amyloid": 413,
      "APS-reductase_C": 414,
      "APS_kinase": 415,
      "APT": 416,
      "AP_endonuc_2": 417,
      "ARA70": 418,
      "ARC6-like_IMS": 419,
      "ARD": 420,
      "ARF7EP_C": 421,
      "ARGLU": 422,
      "ARHGEF5_35": 423,
      "ARID": 424,
      "ARL17": 425,
      "ARL2_Bind_BART": 426,
      "ARL6IP6": 427,
      "ARMET_C": 428,
      "ARMET_N": 429,
      "ARMH2": 430,
      "ARMH3_C": 431,
      "ARMH4": 432,
      "ARMT1-like_dom": 433,
      "AROS": 434,
      "ARPC4": 435,
      "ARS2": 436,
      "ART": 437,
      "ART-PolyVal": 438,
      "ARTD15_N": 439,
      "ASC": 440,
      "ASCH": 441,
      "ASD1": 442,
      "ASD2": 443,
      "ASF1_hist_chap": 444,
      "ASFV_360": 445,
      "ASFV_J13L": 446,
      "ASFV_L11L": 447,
      "ASFV_p27": 448,
      "ASH": 449,
      "ASK_PH": 450,
      "ASL_C": 451,
      "ASL_C2": 452,
      "ASMase_C": 453,
      "ASPRs": 454,
      "ASRT": 455,
      "ASTER": 456,
      "ASTN1_2_EGF_Fn": 457,
      "ASTN_1_2_N": 458,
      "ASTN_2_hairpin": 459,
      "ASXH": 460,
      "ASY3-like": 461,
      "ATAD3_N": 462,
      "ATAD4": 463,
      "ATC_hydrolase": 464,
      "ATE_C": 465,
      "ATE_N": 466,
      "ATF7IP_BD": 467,
      "ATG101": 468,
      "ATG11": 469,
      "ATG13": 470,
      "ATG14": 471,
      "ATG16": 472,
      "ATG17_like": 473,
      "ATG19": 474,
      "ATG22": 475,
      "ATG27": 476,
      "ATG29_N": 477,
      "ATG2_CAD": 478,
      "ATG31": 479,
      "ATG43": 480,
      "ATG4_LIR": 481,
      "ATG7_N": 482,
      "ATG8": 483,
      "ATG9": 484,
      "ATG_C": 485,
      "ATHILA": 486,
      "ATLF": 487,
      "ATP-cone": 488,
      "ATP-grasp": 489,
      "ATP-grasp_2": 490,
      "ATP-grasp_3": 491,
      "ATP-grasp_4": 492,
      "ATP-grasp_5": 493,
      "ATP-grasp_6": 494,
      "ATP-gua_Ptrans": 495,
      "ATP-gua_PtransN": 496,
      "ATP-sulfurylase": 497,
      "ATP-synt": 498,
      "ATP-synt_10": 499,
      "ATP-synt_8": 500,
      "ATP-synt_A": 501,
      "ATP-synt_B": 502,
      "ATP-synt_C": 503,
      "ATP-synt_D": 504,
      "ATP-synt_DE": 505,
      "ATP-synt_DE_N": 506,
      "ATP-synt_E": 507,
      "ATP-synt_E_2": 508,
      "ATP-synt_Eps": 509,
      "ATP-synt_F": 510,
      "ATP-synt_F6": 511,
      "ATP-synt_G": 512,
      "ATP-synt_I": 513,
      "ATP-synt_J": 514,
      "ATP-synt_Z": 515,
      "ATP-synt_ab": 516,
      "ATP-synt_ab_C": 517,
      "ATP-synt_ab_N": 518,
      "ATP-synt_ab_Xtn": 519,
      "ATP11": 520,
      "ATP12": 521,
      "ATP13": 522,
      "ATP19": 523,
      "ATP1G1_PLM_MAT8": 524,
      "ATP_Ca_trans_C": 525,
      "ATP_bind_1": 526,
      "ATP_bind_2": 527,
      "ATP_bind_3": 528,
      "ATP_sub_h": 529,
      "ATP_synt_H": 530,
      "ATP_synth_reg": 531,
      "ATP_transf": 532,
      "ATPase": 533,
      "ATPase-cat_bd": 534,
      "ATPase_2": 535,
      "ATPase_RavA_C": 536,
      "ATPase_gene1": 537,
      "ATPgrasp_N": 538,
      "ATPgrasp_ST": 539,
      "ATPgrasp_Ter": 540,
      "ATPgrasp_TupA": 541,
      "ATPgrasp_YheCD": 542,
      "ATR13": 543,
      "ATS": 544,
      "ATS3": 545,
      "ATXN-1_C": 546,
      "ATX_III": 547,
      "AT_hook": 548,
      "AUDH_Cupin": 549,
      "AUX_IAA": 550,
      "AWPM-19": 551,
      "AWS": 552,
      "AXE1": 553,
      "AXH": 554,
      "AXIN1_TNKS_BD": 555,
      "AZUL": 556,
      "A_amylase_dom_C": 557,
      "A_amylase_inhib": 558,
      "A_deamin": 559,
      "A_deaminase": 560,
      "A_deaminase_N": 561,
      "A_thal_3526": 562,
      "Aa_trans": 563,
      "AadA_C": 564,
      "AalphaY_MDB": 565,
      "AbLIM_anchor": 566,
      "AbbA_antirepres": 567,
      "Abdominal-A": 568,
      "AbfB": 569,
      "AbfS_sensor": 570,
      "Abhydro_lipase": 571,
      "Abhydrolase_1": 572,
      "Abhydrolase_10": 573,
      "Abhydrolase_11": 574,
      "Abhydrolase_2": 575,
      "Abhydrolase_3": 576,
      "Abhydrolase_4": 577,
      "Abhydrolase_5": 578,
      "Abhydrolase_6": 579,
      "Abhydrolase_7": 580,
      "Abhydrolase_8": 581,
      "Abhydrolase_9": 582,
      "Abhydrolase_9_N": 583,
      "AbiEi_1": 584,
      "AbiEi_2": 585,
      "AbiEi_3": 586,
      "AbiEi_3_N": 587,
      "AbiEi_4": 588,
      "AbiEii": 589,
      "AbiGi": 590,
      "AbiGii_2": 591,
      "AbiH": 592,
      "AbiJ_NTD3": 593,
      "AbiJ_NTD4": 594,
      "AbiJ_NTD5": 595,
      "AbiTii": 596,
      "Abi_2": 597,
      "Abi_C": 598,
      "Abi_HHR": 599,
      "Abi_alpha": 600,
      "Abp2": 601,
      "AbrB": 602,
      "AbrB-like": 603,
      "AbrB_C": 604,
      "Ac110_PIF": 605,
      "Ac45-VOA1_TM": 606,
      "Ac76": 607,
      "Ac81": 608,
      "AcMNPV_AC11": 609,
      "AcMNPV_Ac109": 610,
      "AcMNPV_Ac75": 611,
      "AcMNPV_Orf101": 612,
      "AcMNPV_Orf17": 613,
      "AcMNPV_Orf18": 614,
      "AcMNPV_P18": 615,
      "AcaB": 616,
      "Acatn": 617,
      "Acc5b_avian_CoV": 618,
      "AceK_kinase": 619,
      "AceK_regulatory": 620,
      "AcetDehyd-dimer": 621,
      "Acetate_kinase": 622,
      "Acetone_carb_G": 623,
      "AcetylCoA_hyd_C": 624,
      "AcetylCoA_hydro": 625,
      "Acetyltransf_1": 626,
      "Acetyltransf_10": 627,
      "Acetyltransf_11": 628,
      "Acetyltransf_13": 629,
      "Acetyltransf_14": 630,
      "Acetyltransf_15": 631,
      "Acetyltransf_16": 632,
      "Acetyltransf_17": 633,
      "Acetyltransf_18": 634,
      "Acetyltransf_19": 635,
      "Acetyltransf_2": 636,
      "Acetyltransf_3": 637,
      "Acetyltransf_4": 638,
      "Acetyltransf_5": 639,
      "Acetyltransf_6": 640,
      "Acetyltransf_7": 641,
      "Acetyltransf_8": 642,
      "Acetyltransf_9": 643,
      "Acetyltransf_CG": 644,
      "Acid_PPase": 645,
      "Acid_phosphat_B": 646,
      "AcnX": 647,
      "AcnX_swivel_put": 648,
      "Aconitase": 649,
      "Aconitase_2_N": 650,
      "Aconitase_B_N": 651,
      "Aconitase_C": 652,
      "Acp26Ab": 653,
      "AcrZ": 654,
      "Act-Frag_cataly": 655,
      "ActA": 656,
      "ActD": 657,
      "Actin": 658,
      "Actin_micro": 659,
      "Actino_peptide": 660,
      "Activator-TraM": 661,
      "Activator_LAG-3": 662,
      "Activin_recp": 663,
      "Acyl-ACP_TE": 664,
      "Acyl-CoA_dh_1": 665,
      "Acyl-CoA_dh_2": 666,
      "Acyl-CoA_dh_C": 667,
      "Acyl-CoA_dh_M": 668,
      "Acyl-CoA_dh_N": 669,
      "Acyl-CoA_ox_N": 670,
      "Acyl-thio_N": 671,
      "AcylCoA_DH_N": 672,
      "AcylCoA_dehyd_C": 673,
      "Acyl_CoA_thio": 674,
      "Acyl_transf_1": 675,
      "Acyl_transf_2": 676,
      "Acyl_transf_3": 677,
      "Acylphosphatase": 678,
      "Acyltransf_2": 679,
      "Acyltransf_C": 680,
      "Acyltransferase": 681,
      "AdHead_fibreRBD": 682,
      "Ad_Cy_reg": 683,
      "Ad_cyc_g-alpha": 684,
      "Ada3": 685,
      "Ada_Zn_binding": 686,
      "Adap_comp_sub": 687,
      "Adaptin_N": 688,
      "Adaptin_binding": 689,
      "Adcy_cons_dom": 690,
      "AdeT1_2": 691,
      "Adenine_deam_C": 692,
      "Adenine_glyco": 693,
      "Adeno_100": 694,
      "Adeno_52K": 695,
      "Adeno_E1A": 696,
      "Adeno_E1B_19K": 697,
      "Adeno_E1B_55K": 698,
      "Adeno_E1B_55K_N": 699,
      "Adeno_E3": 700,
      "Adeno_E3A": 701,
      "Adeno_E3B": 702,
      "Adeno_E3_14_5": 703,
      "Adeno_E3_15_3": 704,
      "Adeno_E3_CR1": 705,
      "Adeno_E3_CR2": 706,
      "Adeno_E4": 707,
      "Adeno_E4_34": 708,
      "Adeno_E4_ORF3": 709,
      "Adeno_GP19K": 710,
      "Adeno_IVa2": 711,
      "Adeno_L433K_22K": 712,
      "Adeno_PIX": 713,
      "Adeno_PV": 714,
      "Adeno_PVIII": 715,
      "Adeno_PX": 716,
      "Adeno_Penton_B": 717,
      "Adeno_VII": 718,
      "Adeno_hexon": 719,
      "Adeno_hexon_C": 720,
      "Adeno_knob": 721,
      "Adeno_shaft": 722,
      "Adeno_terminal": 723,
      "Adenosine_kin": 724,
      "Adenyl_cycl_N": 725,
      "Adenyl_transf": 726,
      "AdenylateSensor": 727,
      "Adenylate_cycl": 728,
      "Adenylsucc_synt": 729,
      "Adhes-Ig_like": 730,
      "Adhesin_Dr": 731,
      "Adhesin_E": 732,
      "Adhesin_P1_C": 733,
      "Adhesin_P1_N": 734,
      "Adipogenin": 735,
      "Adipokin_hormo": 736,
      "AdoHcyase": 737,
      "AdoHcyase_NAD": 738,
      "AdoMetDC_leader": 739,
      "AdoMet_MTase": 740,
      "AdoMet_Synthase": 741,
      "AdoMet_dc": 742,
      "Aegerolysin": 743,
      "Aerolysin": 744,
      "AfaD": 745,
      "Afaf": 746,
      "Afi1": 747,
      "AflR": 748,
      "AfsA": 749,
      "Aft1_HRA": 750,
      "Aft1_HRR": 751,
      "Aft1_OSA": 752,
      "AftA_C": 753,
      "AftA_N": 754,
      "Ag332": 755,
      "AgI_II_C2": 756,
      "Agarase_CBM": 757,
      "Agenet": 758,
      "Agglutinin": 759,
      "Agglutinin_C": 760,
      "AglB_L1": 761,
      "Ago_N_1": 762,
      "Ago_hook": 763,
      "Agouti": 764,
      "AgrB": 765,
      "AgrD": 766,
      "Agro_virD5": 767,
      "Aha1_N": 768,
      "AhpC-TSA": 769,
      "AhpC-TSA_2": 770,
      "AidB_N": 771,
      "Aida_C2": 772,
      "Aida_N": 773,
      "Ail_Lom": 774,
      "Aim19": 775,
      "Aim21": 776,
      "AlaDh_PNT_C": 777,
      "AlaDh_PNT_N": 778,
      "AlaE": 779,
      "Ala_racemase_C": 780,
      "Ala_racemase_N": 781,
      "Alanine_zipper": 782,
      "Alb1": 783,
      "AlbA_2": 784,
      "Alba": 785,
      "Albumin_I": 786,
      "Albumin_I_a": 787,
      "AlcCBM31": 788,
      "Ald_Xan_dh_C": 789,
      "Ald_deCOase": 790,
      "Aldedh": 791,
      "Aldo_ket_red": 792,
      "Aldolase": 793,
      "Aldolase_II": 794,
      "Aldose_epim": 795,
      "Alfin": 796,
      "Alg14": 797,
      "Alg6_Alg8": 798,
      "AlgF": 799,
      "Alginate_exp": 800,
      "Alginate_lyase": 801,
      "Alginate_lyase2": 802,
      "AlkA_N": 803,
      "Alk_phosphatase": 804,
      "Alkyl_sulf_C": 805,
      "Alkyl_sulf_dimr": 806,
      "Allantoicase": 807,
      "Allatostatin": 808,
      "Allene_ox_cyc": 809,
      "Allexi_40kDa": 810,
      "Alliinase_C": 811,
      "Alph_Pro_TM": 812,
      "Alpha-2-MRAP_C": 813,
      "Alpha-2-MRAP_N": 814,
      "Alpha-E": 815,
      "Alpha-L-AF_C": 816,
      "Alpha-amy_C_pro": 817,
      "Alpha-amyl_C": 818,
      "Alpha-amyl_C2": 819,
      "Alpha-amylase": 820,
      "Alpha-amylase_C": 821,
      "Alpha-amylase_N": 822,
      "Alpha-mann_mid": 823,
      "AlphaC_N": 824,
      "AlphaC_N2": 825,
      "Alpha_E1_glycop": 826,
      "Alpha_E2_glycop": 827,
      "Alpha_E3_glycop": 828,
      "Alpha_GJ": 829,
      "Alpha_Helical": 830,
      "Alpha_L_fucos": 831,
      "Alpha_TIF": 832,
      "Alpha_adaptinC2": 833,
      "Alpha_adaptin_C": 834,
      "Alpha_kinase": 835,
      "AltA1": 836,
      "Alveol-reg_P311": 837,
      "Amastin": 838,
      "Amdase": 839,
      "Amdo_NSP": 840,
      "Amelin": 841,
      "Amelogenin": 842,
      "Amelotin": 843,
      "AmiS_UreI": 844,
      "Amidase": 845,
      "Amidase_2": 846,
      "Amidase_3": 847,
      "Amidase_5": 848,
      "Amidase_6": 849,
      "Amido_AtzD_TrzD": 850,
      "Amidohydro_1": 851,
      "Amidohydro_2": 852,
      "Amidohydro_3": 853,
      "Amidoligase_2": 854,
      "Amino_oxidase": 855,
      "Aminoglyc_resit": 856,
      "Aminopep": 857,
      "Aminotran_1_2": 858,
      "Aminotran_3": 859,
      "Aminotran_4": 860,
      "Aminotran_5": 861,
      "Amj": 862,
      "Ammonium_transp": 863,
      "Amnionless": 864,
      "AmoC": 865,
      "AmpE": 866,
      "Amphi-Trp": 867,
      "AmyA-A_glucT_m": 868,
      "AmyA-gluTrfs_C": 869,
      "An_peroxidase": 870,
      "Androgen_recep": 871,
      "Anemone_cytotox": 872,
      "AnfG_VnfG": 873,
      "AnfO_nitrog": 874,
      "Angiomotin_C": 875,
      "Anillin": 876,
      "Anillin_N": 877,
      "Ank": 878,
      "AnkUBD": 879,
      "Ank_2": 880,
      "Ank_3": 881,
      "Ank_4": 882,
      "Ank_5": 883,
      "AnmK": 884,
      "Annexin": 885,
      "Annexin_like": 886,
      "Anoct_dimer": 887,
      "Anoctamin": 888,
      "Anophelin": 889,
      "Anp1": 890,
      "AntA": 891,
      "Ant_C": 892,
      "Anth_Ig": 893,
      "Anth_synt_I_N": 894,
      "Anthrax-tox_M": 895,
      "Anthrax_toxA": 896,
      "Anthrone_oxy": 897,
      "Anti-LPS-SCYG": 898,
      "Anti-RecBCD_p2": 899,
      "Anti-TRAP": 900,
      "Anti-adapt_IraP": 901,
      "Antibiotic_NAT": 902,
      "Anticodon_1": 903,
      "Anticodon_2": 904,
      "Anticodon_3": 905,
      "Antifungal_pept": 906,
      "Antifungal_prot": 907,
      "Antig_Caf1": 908,
      "Antigen_Bd37": 909,
      "Antigen_C": 910,
      "Antimicrobial10": 911,
      "Antimicrobial11": 912,
      "Antimicrobial12": 913,
      "Antimicrobial13": 914,
      "Antimicrobial14": 915,
      "Antimicrobial15": 916,
      "Antimicrobial17": 917,
      "Antimicrobial18": 918,
      "Antimicrobial19": 919,
      "Antimicrobial20": 920,
      "Antimicrobial21": 921,
      "Antimicrobial22": 922,
      "Antimicrobial23": 923,
      "Antimicrobial24": 924,
      "Antimicrobial25": 925,
      "Antimicrobial_1": 926,
      "Antimicrobial_2": 927,
      "Antimicrobial_3": 928,
      "Antimicrobial_4": 929,
      "Antimicrobial_5": 930,
      "Antimicrobial_6": 931,
      "Antimicrobial_7": 932,
      "Antimicrobial_8": 933,
      "Antimicrobial_9": 934,
      "Antirestrict": 935,
      "Antistasin": 936,
      "Antiterm": 937,
      "Antitox_RHH": 938,
      "Ap4A_phos_N": 939,
      "ApbA": 940,
      "ApbA_C": 941,
      "ApbE": 942,
      "Apc13p": 943,
      "Apc15p": 944,
      "Apc1_MidN": 945,
      "Apc1_N": 946,
      "ApeA_NTD1": 947,
      "ApeC": 948,
      "Apelin": 949,
      "Apex": 950,
      "Aph-1": 951,
      "AphA_like": 952,
      "Apidaecin": 953,
      "Apis_Csd": 954,
      "Apo-CII": 955,
      "Apo-CIII": 956,
      "Apo-VLDL-II": 957,
      "ApoA-II": 958,
      "ApoB100_C": 959,
      "ApoC-I": 960,
      "ApoL": 961,
      "ApoLp-III": 962,
      "ApoM": 963,
      "ApoO": 964,
      "Apocytochr_F_C": 965,
      "Apocytochr_F_N": 966,
      "Apolipo_F": 967,
      "Apolipoprotein": 968,
      "Apq12": 969,
      "Apt1": 970,
      "Apyrase": 971,
      "Aquarius_N": 972,
      "ArAE_1": 973,
      "ArAE_1_C": 974,
      "ArAE_2": 975,
      "ArAE_2_N": 976,
      "AraC_N": 977,
      "AraC_binding": 978,
      "AraC_binding_2": 979,
      "AraR_C": 980,
      "ArabFuran-catal": 981,
      "Arabino_trans_C": 982,
      "Arabino_trans_N": 983,
      "Arabinose_Iso_C": 984,
      "Arabinose_Isome": 985,
      "Arabinose_bd": 986,
      "Arabinose_trans": 987,
      "Arb1": 988,
      "Arb2": 989,
      "Arc": 990,
      "Arc_C": 991,
      "Arc_MA": 992,
      "Arc_PepC": 993,
      "Arc_PepC_II": 994,
      "Arc_trans_TRASH": 995,
      "Arcadin_1": 996,
      "Arch_fla_DE": 997,
      "Arch_flagellin": 998,
      "Archaeal_AmoA": 999,
      "Archease": 1000,
      "ArdA": 1001,
      "ArdcN": 1002,
      "AreA_N": 1003,
      "ArenaCapSnatch": 1004,
      "Arena_RNA_pol": 1005,
      "Arena_glycoprot": 1006,
      "Arena_ncap_C": 1007,
      "Arena_nucleocap": 1008,
      "Arf": 1009,
      "ArfA": 1010,
      "ArfGap": 1011,
      "Arfaptin": 1012,
      "ArgJ": 1013,
      "Arg_decarb_HB": 1014,
      "Arg_decarbox_C": 1015,
      "Arg_repressor": 1016,
      "Arg_repressor_C": 1017,
      "Arg_tRNA_synt_N": 1018,
      "Arginase": 1019,
      "Arginosuc_synth": 1020,
      "ArgoL1": 1021,
      "ArgoL2": 1022,
      "ArgoMid": 1023,
      "ArgoN": 1024,
      "Argos": 1025,
      "Ariadne": 1026,
      "Arif-1": 1027,
      "ArlS_N": 1028,
      "Arm": 1029,
      "Arm-DNA-bind_1": 1030,
      "Arm-DNA-bind_2": 1031,
      "Arm-DNA-bind_3": 1032,
      "Arm-DNA-bind_4": 1033,
      "Arm-DNA-bind_5": 1034,
      "Arm_2": 1035,
      "Arm_3": 1036,
      "Arm_APC_u3": 1037,
      "Arm_vescicular": 1038,
      "ArnB_C": 1039,
      "Arnt_C": 1040,
      "AroM": 1041,
      "Aromatic_hydrox": 1042,
      "Arr-ms": 1043,
      "Arrestin_C": 1044,
      "Arrestin_N": 1045,
      "ArsA_ATPase": 1046,
      "ArsA_HSP20": 1047,
      "ArsB": 1048,
      "ArsC": 1049,
      "ArsD": 1050,
      "ArsP_1": 1051,
      "ArsP_2": 1052,
      "ArsR": 1053,
      "Arteri_GP4": 1054,
      "Arteri_Gl": 1055,
      "Arteri_env": 1056,
      "Arteri_nsp7a": 1057,
      "Arteri_nucleo": 1058,
      "Arv1": 1059,
      "Arylesterase": 1060,
      "Arylsulfotran_2": 1061,
      "Arylsulfotran_N": 1062,
      "Arylsulfotrans": 1063,
      "Ashwin": 1064,
      "AsiA": 1065,
      "AsmA": 1066,
      "AsmA_1": 1067,
      "AsmA_2": 1068,
      "AsnA": 1069,
      "AsnC_trans_reg": 1070,
      "AsnC_trans_reg2": 1071,
      "Asn_synthase": 1072,
      "Asp": 1073,
      "Asp-Al_Ex": 1074,
      "Asp-B-Hydro_N": 1075,
      "Asp1": 1076,
      "Asp2": 1077,
      "Asp23": 1078,
      "Asp4": 1079,
      "Asp5": 1080,
      "Asp_Arg_Hydrox": 1081,
      "Asp_DH_C": 1082,
      "Asp_Glu_race": 1083,
      "Asp_Glu_race_2": 1084,
      "Asp_aminotransf": 1085,
      "Asp_decarbox": 1086,
      "Asp_protease": 1087,
      "Asp_protease_2": 1088,
      "Asparaginase": 1089,
      "Asparaginase_2": 1090,
      "Asparaginase_C": 1091,
      "Asparaginase_II": 1092,
      "Aspzincin_M35": 1093,
      "Asr": 1094,
      "AstA": 1095,
      "AstB": 1096,
      "AstE_AspA": 1097,
      "Astacin": 1098,
      "Astro_1A": 1099,
      "Astro_VPg": 1100,
      "Astro_capsid_N": 1101,
      "Astro_capsid_p": 1102,
      "Astro_capsid_p2": 1103,
      "Astro_p19": 1104,
      "Astrovir_pp_1": 1105,
      "At2g31720-like": 1106,
      "AtaL": 1107,
      "Atg11_middle": 1108,
      "AtpR": 1109,
      "Atracotoxin": 1110,
      "Atrophin-1": 1111,
      "Attachment_P66": 1112,
      "Attacin_C": 1113,
      "Attacin_N": 1114,
      "Atthog": 1115,
      "Attractin": 1116,
      "Atu4866": 1117,
      "AtuA": 1118,
      "Atx10homo_assoc": 1119,
      "Atypical_Card": 1120,
      "AtzG-like": 1121,
      "Augurin": 1122,
      "AurF": 1123,
      "Aurora-A_bind": 1124,
      "Auto_anti-p27": 1125,
      "Autoind_bind": 1126,
      "Autoind_synth": 1127,
      "Autophagy_act_C": 1128,
      "Autotransporter": 1129,
      "Auts2": 1130,
      "Auxin_BP": 1131,
      "Auxin_canalis": 1132,
      "Auxin_inducible": 1133,
      "Auxin_repressed": 1134,
      "Auxin_resp": 1135,
      "Av_adeno_fibre": 1136,
      "AveC_like": 1137,
      "AviRa": 1138,
      "Avian_gp85": 1139,
      "Avidin": 1140,
      "Avl9": 1141,
      "AvrB_AvrC": 1142,
      "AvrD": 1143,
      "AvrE_T3Es": 1144,
      "AvrL567-A": 1145,
      "AvrLm4-7": 1146,
      "AvrM-A": 1147,
      "AvrM_N": 1148,
      "AvrPphF-ORF-2": 1149,
      "AvrPto": 1150,
      "AvrPtoB-E3_ubiq": 1151,
      "AvrPtoB_bdg": 1152,
      "AvrRpt-cleavage": 1153,
      "Ax_dynein_light": 1154,
      "Axin_b-cat_bind": 1155,
      "AzlC": 1156,
      "AzlD": 1157,
      "B": 1158,
      "B-CoV_A_NSP1": 1159,
      "B-block_TFIIIC": 1160,
      "B1": 1161,
      "B12-binding": 1162,
      "B12-binding_2": 1163,
      "B12D": 1164,
      "B2": 1165,
      "B2-adapt-app_C": 1166,
      "B277": 1167,
      "B3": 1168,
      "B3GALT2_N": 1169,
      "B3R": 1170,
      "B3_4": 1171,
      "B5": 1172,
      "B56": 1173,
      "B9-C2": 1174,
      "BA14K": 1175,
      "BAALC_N": 1176,
      "BAAT_C": 1177,
      "BACK": 1178,
      "BACON": 1179,
      "BACON_2": 1180,
      "BAF": 1181,
      "BAF1_ABF1": 1182,
      "BAF250_C": 1183,
      "BAG": 1184,
      "BAG6": 1185,
      "BAGE": 1186,
      "BAH": 1187,
      "BALF1": 1188,
      "BAMBI": 1189,
      "BAMBI_C": 1190,
      "BAP": 1191,
      "BAR": 1192,
      "BAR_2": 1193,
      "BAR_3": 1194,
      "BAR_3_WASP_bdg": 1195,
      "BAR_4": 1196,
      "BASP1": 1197,
      "BAT": 1198,
      "BAT2_N": 1199,
      "BATS": 1200,
      "BBE": 1201,
      "BBIP10": 1202,
      "BBL5": 1203,
      "BBMV_Gp1_N": 1204,
      "BBP1_C": 1205,
      "BBP1_N": 1206,
      "BBP2": 1207,
      "BBP2_2": 1208,
      "BBP7": 1209,
      "BBS1": 1210,
      "BBS2_C": 1211,
      "BBS2_Mid": 1212,
      "BBS2_N": 1213,
      "BB_PF": 1214,
      "BC10": 1215,
      "BCAS2": 1216,
      "BCAS3": 1217,
      "BCA_ABC_TP_C": 1218,
      "BCCIP": 1219,
      "BCCT": 1220,
      "BCD": 1221,
      "BCDHK_Adom3": 1222,
      "BCHF": 1223,
      "BCL9": 1224,
      "BCLP": 1225,
      "BCL_N": 1226,
      "BCMA-Tall_bind": 1227,
      "BCNT": 1228,
      "BCOR": 1229,
      "BCS1_N": 1230,
      "BCSC_C": 1231,
      "BChl_A": 1232,
      "BD-FAE": 1233,
      "BDHCT": 1234,
      "BDHCT_assoc": 1235,
      "BDM": 1236,
      "BDV_G": 1237,
      "BDV_M": 1238,
      "BDV_P10": 1239,
      "BDV_P24": 1240,
      "BDV_P40": 1241,
      "BD_b_sandwich": 1242,
      "BEN": 1243,
      "BES1_N": 1244,
      "BESS": 1245,
      "BET": 1246,
      "BEX": 1247,
      "BE_C": 1248,
      "BFN_dom": 1249,
      "BH3": 1250,
      "BH4": 1251,
      "BHD_1": 1252,
      "BHD_2": 1253,
      "BHD_3": 1254,
      "BID": 1255,
      "BIG2_C": 1256,
      "BILBO1_N": 1257,
      "BING4CT": 1258,
      "BIR": 1259,
      "BIRC6": 1260,
      "BIV_Env": 1261,
      "BIg21": 1262,
      "BKACE": 1263,
      "BK_channel_a": 1264,
      "BLACT_WH": 1265,
      "BLF1": 1266,
      "BLH_phosphatase": 1267,
      "BLI1": 1268,
      "BLIP": 1269,
      "BLM10_N": 1270,
      "BLM10_mid": 1271,
      "BLM_N": 1272,
      "BLOC1S3": 1273,
      "BLOC1_2": 1274,
      "BLUF": 1275,
      "BLYB": 1276,
      "BMC": 1277,
      "BMF": 1278,
      "BMFP": 1279,
      "BMP2K_C": 1280,
      "BMT": 1281,
      "BMT5-like": 1282,
      "BNIP2": 1283,
      "BNIP3": 1284,
      "BNR": 1285,
      "BNR_2": 1286,
      "BNR_3": 1287,
      "BNR_4": 1288,
      "BNR_6": 1289,
      "BNR_assoc_N": 1290,
      "BNYVV_TGB3": 1291,
      "BNYVV_p31": 1292,
      "BOF": 1293,
      "BOFC_N": 1294,
      "BON": 1295,
      "BOP1NT": 1296,
      "BORA_N": 1297,
      "BORCS6": 1298,
      "BORCS7": 1299,
      "BORCS8": 1300,
      "BORG_CEP": 1301,
      "BP28CT": 1302,
      "BPA": 1303,
      "BPA_C": 1304,
      "BPD_transp_1": 1305,
      "BPD_transp_1_N": 1306,
      "BPD_transp_2": 1307,
      "BPL_C": 1308,
      "BPL_LplA_LipB": 1309,
      "BPL_LplA_LipB_2": 1310,
      "BPL_N": 1311,
      "BPS": 1312,
      "BPS1": 1313,
      "BPTA": 1314,
      "BRAP2": 1315,
      "BRCA-2_OB1": 1316,
      "BRCA-2_OB3": 1317,
      "BRCA-2_helical": 1318,
      "BRCA2": 1319,
      "BRCC36_C": 1320,
      "BRCT": 1321,
      "BRCT_2": 1322,
      "BRCT_3": 1323,
      "BRCT_assoc": 1324,
      "BRD4_CDT": 1325,
      "BRE": 1326,
      "BRE1": 1327,
      "BRF1": 1328,
      "BRI3": 1329,
      "BRI3BP": 1330,
      "BRICHOS": 1331,
      "BRINP": 1332,
      "BRK": 1333,
      "BRO1": 1334,
      "BROMI": 1335,
      "BRX": 1336,
      "BRX_N": 1337,
      "BRX_assoc": 1338,
      "BSD": 1339,
      "BSMAP": 1340,
      "BSP": 1341,
      "BSP_II": 1342,
      "BST2": 1343,
      "BT1": 1344,
      "BTAD": 1345,
      "BTB": 1346,
      "BTB_2": 1347,
      "BTB_3": 1348,
      "BTD": 1349,
      "BTG": 1350,
      "BTHB": 1351,
      "BTK": 1352,
      "BTP": 1353,
      "BTRD1": 1354,
      "BTV_NS2": 1355,
      "BUD22": 1356,
      "BURAN": 1357,
      "BURP": 1358,
      "B_lectin": 1359,
      "B_solenoid_dext": 1360,
      "B_solenoid_ydck": 1361,
      "Babuvirus_MP": 1362,
      "BacA": 1363,
      "Bac_A_amyl_C": 1364,
      "Bac_DNA_binding": 1365,
      "Bac_DnaA": 1366,
      "Bac_DnaA_C": 1367,
      "Bac_GDH": 1368,
      "Bac_GH3_C": 1369,
      "Bac_RepA_C": 1370,
      "Bac_chlorC": 1371,
      "Bac_export_1": 1372,
      "Bac_export_2": 1373,
      "Bac_export_3": 1374,
      "Bac_globin": 1375,
      "Bac_luciferase": 1376,
      "Bac_rhamnosid": 1377,
      "Bac_rhamnosid6H": 1378,
      "Bac_rhamnosid_C": 1379,
      "Bac_rhamnosid_N": 1380,
      "Bac_rhodopsin": 1381,
      "Bac_small_YrzI": 1382,
      "Bac_thur_toxin": 1383,
      "Bac_transf": 1384,
      "Bacillus_HBL": 1385,
      "Bacillus_PapR": 1386,
      "Bact_hydrolase": 1387,
      "Bact_lectin": 1388,
      "Bact_transglu_N": 1389,
      "BacteriocIIc_cy": 1390,
      "Bacteriocin_II": 1391,
      "Bacteriocin_IIc": 1392,
      "Bacteriocin_IId": 1393,
      "Bacteriocin_IIi": 1394,
      "Bacteroid_pep": 1395,
      "Bactofilin": 1396,
      "Baculo_11_kDa": 1397,
      "Baculo_19": 1398,
      "Baculo_8kDa": 1399,
      "Baculo_Ac102": 1400,
      "Baculo_DNA_bind": 1401,
      "Baculo_E25": 1402,
      "Baculo_E56": 1403,
      "Baculo_E66": 1404,
      "Baculo_F": 1405,
      "Baculo_FP": 1406,
      "Baculo_IE-1": 1407,
      "Baculo_LEF-10": 1408,
      "Baculo_LEF-11": 1409,
      "Baculo_LEF-2": 1410,
      "Baculo_LEF-3": 1411,
      "Baculo_LEF5": 1412,
      "Baculo_LEF5_C": 1413,
      "Baculo_ME53": 1414,
      "Baculo_ODV-E27": 1415,
      "Baculo_PEP_C": 1416,
      "Baculo_PEP_N": 1417,
      "Baculo_PP31": 1418,
      "Baculo_RING": 1419,
      "Baculo_VP1054": 1420,
      "Baculo_VP39": 1421,
      "Baculo_VP91_N": 1422,
      "Baculo_Y142": 1423,
      "Baculo_gp41": 1424,
      "Baculo_gp64": 1425,
      "Baculo_helicase": 1426,
      "Baculo_p24": 1427,
      "Baculo_p26": 1428,
      "Baculo_p33": 1429,
      "Baculo_p47": 1430,
      "Baculo_p48": 1431,
      "Baculo_p74": 1432,
      "Baculo_p74_N": 1433,
      "BaffR-Tall_bind": 1434,
      "BamHI": 1435,
      "Band_3_cyto": 1436,
      "Band_7": 1437,
      "Band_7_1": 1438,
      "Band_7_C": 1439,
      "Bap31": 1440,
      "Bap31_Bap29_C": 1441,
      "Barstar": 1442,
      "Barttin": 1443,
      "Barwin": 1444,
      "Baseplate": 1445,
      "Baseplate_J": 1446,
      "Basic": 1447,
      "BatA": 1448,
      "BatD": 1449,
      "Bax1-I": 1450,
      "BaxI_1": 1451,
      "Bcl-2": 1452,
      "Bcl-2_3": 1453,
      "Bcl-2_BAD": 1454,
      "BclA_C": 1455,
      "Bclt": 1456,
      "Bclx_interact": 1457,
      "Bcr-Abl_Oligo": 1458,
      "BcrAD_BadFG": 1459,
      "BcsB": 1460,
      "Bd3614-deam": 1461,
      "Bd3614_N": 1462,
      "Beach": 1463,
      "Bee_toxin": 1464,
      "BenE": 1465,
      "Benyvirus_14KDa": 1466,
      "Benyvirus_P25": 1467,
      "Bep_C_terminal": 1468,
      "Bestrophin": 1469,
      "BetR": 1470,
      "Bet_v_1": 1471,
      "Beta-APP": 1472,
      "Beta-Casp": 1473,
      "Beta-TrCP_D": 1474,
      "Beta-lactamase": 1475,
      "Beta-lactamase2": 1476,
      "Beta-prism_lec": 1477,
      "BetaGal_dom2": 1478,
      "BetaGal_dom3": 1479,
      "BetaGal_dom4_5": 1480,
      "Beta_elim_lyase": 1481,
      "Beta_helix": 1482,
      "Beta_helix_2": 1483,
      "Beta_helix_3": 1484,
      "Beta_lactamase3": 1485,
      "Beta_propel": 1486,
      "Beta_protein": 1487,
      "BfiI_DBD": 1488,
      "Bgal_small_N": 1489,
      "BiPBP_C": 1490,
      "BicD": 1491,
      "Big_1": 1492,
      "Big_10": 1493,
      "Big_11": 1494,
      "Big_12": 1495,
      "Big_13": 1496,
      "Big_14": 1497,
      "Big_15": 1498,
      "Big_2": 1499,
      "Big_3": 1500,
      "Big_3_2": 1501,
      "Big_3_3": 1502,
      "Big_3_4": 1503,
      "Big_3_5": 1504,
      "Big_4": 1505,
      "Big_5": 1506,
      "Big_6": 1507,
      "Big_7": 1508,
      "Big_8": 1509,
      "Big_9": 1510,
      "Bile_Hydr_Trans": 1511,
      "Biliv-reduc_cat": 1512,
      "Bim_N": 1513,
      "Bin3": 1514,
      "Binary_toxB": 1515,
      "Binary_toxB_2": 1516,
      "Binary_toxB_3": 1517,
      "Bindin": 1518,
      "BioT2": 1519,
      "BioW": 1520,
      "BioY": 1521,
      "Biopterin_H": 1522,
      "Biotin_carb_C": 1523,
      "Biotin_carb_N": 1524,
      "Biotin_lipoyl": 1525,
      "Biotin_lipoyl_2": 1526,
      "Birna_RdRp_C": 1527,
      "Birna_RdRp_palm": 1528,
      "Birna_VP1_thumb": 1529,
      "Birna_VP2": 1530,
      "Birna_VP3": 1531,
      "Birna_VP4": 1532,
      "Birna_VP5": 1533,
      "Blo-t-5": 1534,
      "Blt1": 1535,
      "Blt1_C": 1536,
      "BmKX": 1537,
      "Bmp": 1538,
      "Bmt2": 1539,
      "BofA": 1540,
      "BofC_C": 1541,
      "BolA": 1542,
      "Bombesin": 1543,
      "Bombinin": 1544,
      "Bombolitin": 1545,
      "Borealin": 1546,
      "Borrelia_P13": 1547,
      "Borrelia_P83": 1548,
      "Borrelia_REV": 1549,
      "Borrelia_orfA": 1550,
      "Borrelia_orfD": 1551,
      "Borrelia_orfX": 1552,
      "Bot1p": 1553,
      "Botulinum_HA-17": 1554,
      "Bowman-Birk_leg": 1555,
      "BphX": 1556,
      "BppL_N": 1557,
      "BppU_IgG": 1558,
      "BppU_N": 1559,
      "BpsA_C": 1560,
      "BpuJI_N": 1561,
      "BpuSI_N": 1562,
      "Bradykinin": 1563,
      "Branch": 1564,
      "Branch_AA_trans": 1565,
      "Bravo_FIGEY": 1566,
      "Brix": 1567,
      "BrkDBD": 1568,
      "Brme1": 1569,
      "BrnA_antitoxin": 1570,
      "BrnT_toxin": 1571,
      "Bro-N": 1572,
      "Bromo_MP": 1573,
      "Bromo_TP": 1574,
      "Bromo_TP_like": 1575,
      "Bromo_coat": 1576,
      "Bromodomain": 1577,
      "Brr6_like_C_C": 1578,
      "Brucella_OMP2": 1579,
      "BrxA": 1580,
      "BrxB": 1581,
      "BrxC_BrxD": 1582,
      "BrxL_ATPase": 1583,
      "BrxL_N": 1584,
      "Bse634I": 1585,
      "BshC": 1586,
      "BslA": 1587,
      "BspA_v": 1588,
      "BssB_TutG": 1589,
      "BssC_TutF": 1590,
      "BssS": 1591,
      "BsuBI_PstI_RE": 1592,
      "BsuBI_PstI_RE_N": 1593,
      "BsuPI": 1594,
      "Bt_P21": 1595,
      "BtpA": 1596,
      "BtrH_N": 1597,
      "Btz": 1598,
      "Bubble": 1599,
      "Bud13": 1600,
      "Bud3_N": 1601,
      "Bul1_C": 1602,
      "Bul1_N": 1603,
      "Bundlin": 1604,
      "Bunya_G1": 1605,
      "Bunya_G2": 1606,
      "Bunya_NS-S": 1607,
      "Bunya_NS-S_2": 1608,
      "Bunya_RdRp": 1609,
      "Bunya_nucleocap": 1610,
      "But2": 1611,
      "Bys1": 1612,
      "Bystin": 1613,
      "C-C_Bond_Lyase": 1614,
      "C-JID": 1615,
      "C1-set": 1616,
      "C12orf66_like": 1617,
      "C166": 1618,
      "C1ORF64": 1619,
      "C1_1": 1620,
      "C1_2": 1621,
      "C1_4": 1622,
      "C1q": 1623,
      "C2": 1624,
      "C2-C2_1": 1625,
      "C2-set": 1626,
      "C2-set_2": 1627,
      "C2orf69": 1628,
      "C4": 1629,
      "C4bp_oligo": 1630,
      "C5-epim_C": 1631,
      "C5HCH": 1632,
      "C6": 1633,
      "C6_DPF": 1634,
      "C8": 1635,
      "C9orf72-like": 1636,
      "CAAD": 1637,
      "CAAP1": 1638,
      "CAAX_1": 1639,
      "CABIT": 1640,
      "CABS1": 1641,
      "CAC1F_C": 1642,
      "CADH_Y-type_LIR": 1643,
      "CAF-1_p150": 1644,
      "CAF-1_p60_C": 1645,
      "CAF1": 1646,
      "CAF1-p150_C2": 1647,
      "CAF1-p150_N": 1648,
      "CAF1A": 1649,
      "CAF1C_H4-bd": 1650,
      "CAF20": 1651,
      "CAGE1": 1652,
      "CALCOCO1": 1653,
      "CAMP_factor": 1654,
      "CAMSAP_CC1": 1655,
      "CAMSAP_CH": 1656,
      "CAMSAP_CKK": 1657,
      "CANIN": 1658,
      "CAP": 1659,
      "CAP-ZIP_m": 1660,
      "CAP160": 1661,
      "CAP18_C": 1662,
      "CAP59_mtransfer": 1663,
      "CAP_C": 1664,
      "CAP_GLY": 1665,
      "CAP_N": 1666,
      "CAP_assoc_N": 1667,
      "CARD": 1668,
      "CARDB": 1669,
      "CARD_2": 1670,
      "CARM1": 1671,
      "CARME": 1672,
      "CARMIL_C": 1673,
      "CART": 1674,
      "CASP_C": 1675,
      "CASP_dom": 1676,
      "CAS_C": 1677,
      "CAS_CSE1": 1678,
      "CAT": 1679,
      "CATASP": 1680,
      "CATRA-C": 1681,
      "CATRA-N": 1682,
      "CATSPERB": 1683,
      "CATSPERD": 1684,
      "CATSPERG": 1685,
      "CAT_RBD": 1686,
      "CAV_VP3": 1687,
      "CA_like": 1688,
      "CBAH": 1689,
      "CBD_PlyG": 1690,
      "CBF": 1691,
      "CBFB_NFYA": 1692,
      "CBFD_NFYB_HMF": 1693,
      "CBFNT": 1694,
      "CBF_beta": 1695,
      "CBL": 1696,
      "CBM-like": 1697,
      "CBM26": 1698,
      "CBM27": 1699,
      "CBM32": 1700,
      "CBM39": 1701,
      "CBM46": 1702,
      "CBM49": 1703,
      "CBM53": 1704,
      "CBM60": 1705,
      "CBM64": 1706,
      "CBM65_1": 1707,
      "CBM77": 1708,
      "CBM9_1": 1709,
      "CBM9_2": 1710,
      "CBM_1": 1711,
      "CBM_10": 1712,
      "CBM_11": 1713,
      "CBM_14": 1714,
      "CBM_15": 1715,
      "CBM_17_28": 1716,
      "CBM_19": 1717,
      "CBM_2": 1718,
      "CBM_20": 1719,
      "CBM_21": 1720,
      "CBM_25": 1721,
      "CBM_26": 1722,
      "CBM_3": 1723,
      "CBM_35": 1724,
      "CBM_48": 1725,
      "CBM_4_9": 1726,
      "CBM_5_12": 1727,
      "CBM_5_12_2": 1728,
      "CBM_6": 1729,
      "CBM_X2": 1730,
      "CBP": 1731,
      "CBP110": 1732,
      "CBP30": 1733,
      "CBP4": 1734,
      "CBP66": 1735,
      "CBP_BcsF": 1736,
      "CBP_BcsG": 1737,
      "CBP_BcsN": 1738,
      "CBP_BcsO": 1739,
      "CBP_BcsQ": 1740,
      "CBP_BcsR": 1741,
      "CBP_BcsS": 1742,
      "CBP_CCPA": 1743,
      "CBP_GIL": 1744,
      "CBS": 1745,
      "CBX7_C": 1746,
      "CC": 1747,
      "CC149": 1748,
      "CC190": 1749,
      "CC2-LZ": 1750,
      "CC2D2AN-C2": 1751,
      "CCAP": 1752,
      "CCB1": 1753,
      "CCB2_CCB4": 1754,
      "CCCAP": 1755,
      "CCD": 1756,
      "CCD48": 1757,
      "CCD97-like_C": 1758,
      "CCDC-167": 1759,
      "CCDC106": 1760,
      "CCDC117": 1761,
      "CCDC14": 1762,
      "CCDC142": 1763,
      "CCDC144C": 1764,
      "CCDC154": 1765,
      "CCDC158": 1766,
      "CCDC168_N": 1767,
      "CCDC22": 1768,
      "CCDC23": 1769,
      "CCDC24": 1770,
      "CCDC28": 1771,
      "CCDC32": 1772,
      "CCDC34": 1773,
      "CCDC47": 1774,
      "CCDC50_N": 1775,
      "CCDC53": 1776,
      "CCDC66": 1777,
      "CCDC71L": 1778,
      "CCDC73": 1779,
      "CCDC74_C": 1780,
      "CCDC84": 1781,
      "CCDC85": 1782,
      "CCDC90-like": 1783,
      "CCDC92": 1784,
      "CCDC93_CC": 1785,
      "CCER1": 1786,
      "CCG": 1787,
      "CCM2_C": 1788,
      "CCP_MauG": 1789,
      "CCSAP": 1790,
      "CCSMST1": 1791,
      "CCT": 1792,
      "CD20": 1793,
      "CD225": 1794,
      "CD24": 1795,
      "CD34_antigen": 1796,
      "CD36": 1797,
      "CD4-extracel": 1798,
      "CD45": 1799,
      "CD47": 1800,
      "CD52": 1801,
      "CD99L2": 1802,
      "CDC13_N": 1803,
      "CDC14": 1804,
      "CDC24": 1805,
      "CDC24_OB1": 1806,
      "CDC24_OB2": 1807,
      "CDC24_OB3": 1808,
      "CDC27": 1809,
      "CDC37_C": 1810,
      "CDC37_M": 1811,
      "CDC37_N": 1812,
      "CDC45": 1813,
      "CDC48_2": 1814,
      "CDC48_N": 1815,
      "CDC4_D": 1816,
      "CDC50": 1817,
      "CDC73_C": 1818,
      "CDC73_N": 1819,
      "CDCA": 1820,
      "CDH": 1821,
      "CDH-cyt": 1822,
      "CDH1_2_SANT_HL1": 1823,
      "CDI": 1824,
      "CDK2AP": 1825,
      "CDK5RAP3": 1826,
      "CDK5_activator": 1827,
      "CDKN3": 1828,
      "CDO_I": 1829,
      "CDP-OH_P_tran_2": 1830,
      "CDP-OH_P_transf": 1831,
      "CDPS": 1832,
      "CDPS_product": 1833,
      "CDRT4": 1834,
      "CDT1": 1835,
      "CDT1_C": 1836,
      "CDV3": 1837,
      "CDtoxinA": 1838,
      "CE2_N": 1839,
      "CEBP1_N": 1840,
      "CEBP_ZZ": 1841,
      "CECR6_TMEM121": 1842,
      "CEL_III_C": 1843,
      "CEND1": 1844,
      "CENP-B_N": 1845,
      "CENP-B_dimeris": 1846,
      "CENP-C_C": 1847,
      "CENP-C_mid": 1848,
      "CENP-F_C_Rb_bdg": 1849,
      "CENP-F_N": 1850,
      "CENP-F_leu_zip": 1851,
      "CENP-H": 1852,
      "CENP-I": 1853,
      "CENP-K": 1854,
      "CENP-L": 1855,
      "CENP-M": 1856,
      "CENP-N": 1857,
      "CENP-O": 1858,
      "CENP-P": 1859,
      "CENP-Q": 1860,
      "CENP-R": 1861,
      "CENP-S": 1862,
      "CENP-T_C": 1863,
      "CENP-T_N": 1864,
      "CENP-U": 1865,
      "CENP-W": 1866,
      "CENP-X": 1867,
      "CENP_C_N": 1868,
      "CEP1-DNA_bind": 1869,
      "CEP170_C": 1870,
      "CEP19": 1871,
      "CEP209_CC5": 1872,
      "CEP44": 1873,
      "CEP63": 1874,
      "CEP76-C2": 1875,
      "CERK_C": 1876,
      "CF222": 1877,
      "CFA20_dom": 1878,
      "CFAP298": 1879,
      "CFAP300": 1880,
      "CFAP54_N": 1881,
      "CFAP61_N": 1882,
      "CFAP77": 1883,
      "CFAP91": 1884,
      "CFC": 1885,
      "CFEM": 1886,
      "CFIA_Pcf11": 1887,
      "CFSR": 1888,
      "CFTR_R": 1889,
      "CG-1": 1890,
      "CGGC": 1891,
      "CGI-121": 1892,
      "CGLD27-like": 1893,
      "CH": 1894,
      "CHAD": 1895,
      "CHAP": 1896,
      "CHASE": 1897,
      "CHASE2": 1898,
      "CHASE3": 1899,
      "CHASE4": 1900,
      "CHASE5": 1901,
      "CHASE6_C": 1902,
      "CHASE7": 1903,
      "CHASE8": 1904,
      "CHASE9": 1905,
      "CHAT": 1906,
      "CHB_HEX": 1907,
      "CHB_HEX_C": 1908,
      "CHB_HEX_C_1": 1909,
      "CHCH": 1910,
      "CHD5": 1911,
      "CHDCT2": 1912,
      "CHDII_SANT-like": 1913,
      "CHDNT": 1914,
      "CHGN": 1915,
      "CHIPS": 1916,
      "CHIP_TPR_N": 1917,
      "CHMI": 1918,
      "CHORD": 1919,
      "CHRD": 1920,
      "CHRDL_1_2_C": 1921,
      "CHS5_N": 1922,
      "CHU_C": 1923,
      "CHZ": 1924,
      "CH_2": 1925,
      "CI-B14_5a": 1926,
      "CIA30": 1927,
      "CIAPIN1": 1928,
      "CID": 1929,
      "CIDE-N": 1930,
      "CIDR1_gamma": 1931,
      "CID_GANP": 1932,
      "CIF": 1933,
      "CIMR": 1934,
      "CIS_TMP": 1935,
      "CIS_spike_tip": 1936,
      "CIS_tube": 1937,
      "CITED": 1938,
      "CK1gamma_C": 1939,
      "CK2S": 1940,
      "CKAP2_C": 1941,
      "CKI": 1942,
      "CKS": 1943,
      "CK_II_beta": 1944,
      "CLAG": 1945,
      "CLAMP": 1946,
      "CLASP_N": 1947,
      "CLCA": 1948,
      "CLEC16A_C": 1949,
      "CLIP": 1950,
      "CLIP1_ZNF": 1951,
      "CLIP_1": 1952,
      "CLIP_SPH_Scar": 1953,
      "CLIP_SPH_mas": 1954,
      "CLLAC": 1955,
      "CLN3": 1956,
      "CLN5": 1957,
      "CLN6": 1958,
      "CLP1_N": 1959,
      "CLP1_P": 1960,
      "CLPTM1": 1961,
      "CLP_protease": 1962,
      "CLSTN_C": 1963,
      "CLU": 1964,
      "CLU_N": 1965,
      "CLZ": 1966,
      "CM1": 1967,
      "CM2": 1968,
      "CMAS": 1969,
      "CMD": 1970,
      "CMS1": 1971,
      "CMV_1a": 1972,
      "CMV_1a_C": 1973,
      "CMV_US": 1974,
      "CM_1": 1975,
      "CM_2": 1976,
      "CNDH2_C": 1977,
      "CNDH2_M": 1978,
      "CNDH2_N": 1979,
      "CNF1": 1980,
      "CNH": 1981,
      "CNK2_3_dom": 1982,
      "CNNM": 1983,
      "CNOT11": 1984,
      "CNOT1_CAF1_bind": 1985,
      "CNOT1_HEAT": 1986,
      "CNOT1_HEAT_N": 1987,
      "CNOT1_TTP_bind": 1988,
      "CNP1": 1989,
      "CNP_C_terminal": 1990,
      "CNPase": 1991,
      "CNRIP1": 1992,
      "CNTF": 1993,
      "CNV-Replicase_N": 1994,
      "CN_hydrolase": 1995,
      "COA2": 1996,
      "COA8": 1997,
      "COBRA": 1998,
      "COBRA1": 1999,
      "CODH_A_N": 2000,
      "COE1_DBD": 2001,
      "COE1_HLH": 2002,
      "COG2": 2003,
      "COG2_C": 2004,
      "COG4": 2005,
      "COG5": 2006,
      "COG6": 2007,
      "COG7": 2008,
      "COLFI": 2009,
      "COMMD1_N": 2010,
      "COMM_domain": 2011,
      "COMP": 2012,
      "COMPASS-Shg1": 2013,
      "COOH-NH2_lig": 2014,
      "COP-gamma_platf": 2015,
      "COP23": 2016,
      "COPIIcoated_ERV": 2017,
      "COPI_C": 2018,
      "COPI_assoc": 2019,
      "COPR5": 2020,
      "COQ7": 2021,
      "COQ9": 2022,
      "COR": 2023,
      "COS": 2024,
      "COX1": 2025,
      "COX14": 2026,
      "COX15-CtaA": 2027,
      "COX16": 2028,
      "COX17": 2029,
      "COX2": 2030,
      "COX2-transmemb": 2031,
      "COX24_C": 2032,
      "COX2_TM": 2033,
      "COX3": 2034,
      "COX4": 2035,
      "COX4_pro": 2036,
      "COX4_pro_2": 2037,
      "COX5A": 2038,
      "COX5B": 2039,
      "COX6A": 2040,
      "COX6B": 2041,
      "COX6C": 2042,
      "COX7B": 2043,
      "COX7C": 2044,
      "COX7a": 2045,
      "COX8": 2046,
      "COXG": 2047,
      "COX_ARM": 2048,
      "CO_deh_flav_C": 2049,
